micropython/micropython/ports/psoc-edge/machine_pdm_pcm.c
    if (intr_status & CY_PDM_PCM_INTR_RX_TRIGGER) {
        /* Move data from the PDM fifo and place it in a buffer */
        uint32_t index = 0;
        for (uint32_t i = 0; i < (RX_FIFO_TRIG_LEVEL / num_channels); i++) {
            if (self->format == MONO_LEFT) {
                int32_t data = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, LEFT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_TRIG_LEVEL + index] = (int16_t)(data);
                index++;
            } else if (self->format == MONO_RIGHT) {
                int32_t data = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, RIGHT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_TRIG_LEVEL + index] = (int16_t)(data);
                index++;
            } else {  // STEREO
                int32_t data_left = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, LEFT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_TRIG_LEVEL + index] = (int16_t)(data_left);
                index++;
                int32_t data_right = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, RIGHT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_TRIG_LEVEL + index] = (int16_t)(data_right);
                index++;
            }
        }

        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, int_channel_index, CY_PDM_PCM_INTR_RX_TRIGGER);
        frame_counter++;
    }

    /* Check if the buffer is full */
    if (frame_counter >= NUMBER_INTERRUPTS_FOR_FRAME) {
        /* Flip the active and the next rx buffers */
        int16_t *temp = self->active_rx_buffer;
        self->active_rx_buffer = self->full_rx_buffer;
        self->full_rx_buffer = temp;

        /* Set the have_data flag as true, signaling there is data ready for use */
        if (self->init_discard_counter > 0) {
            self->init_discard_counter--;
            memset(self->full_rx_buffer, 0, FRAME_SIZE * sizeof(int16_t));
        } else {
            self->have_data = true;
        }
        frame_counter = 0;
    }

    /* Handle overflow/underflow errors */
    if (intr_status & (CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW |
                       CY_PDM_PCM_INTR_RX_IF_OVERFLOW | CY_PDM_PCM_INTR_RX_UNDERFLOW)) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, int_channel_index, CY_PDM_PCM_INTR_MASK);
    }
}

// Configure PDM_PCM IRQ
static void pdm_pcm_irq_configure(machine_pdm_pcm_obj_t *self) {
    mplogger_print("pdm_pcm_irq_configure \r\n");

    cy_stc_sysint_t irq_cfg = {
        .intrSrc = self->irq_num,
        .intrPriority = PDM_PCM_ISR_PRIORITY
    };

    cy_rslt_t result = Cy_SysInt_Init(&irq_cfg, pdm_pcm_irq_handler);
    if (result != CY_SYSINT_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("PDM_PCM interrupt configuration failed with return code %lx !"), result);
    }

    NVIC_ClearPendingIRQ(irq_cfg.intrSrc);
    NVIC_EnableIRQ(irq_cfg.intrSrc);
}


// =======================================================================================
// MPY bindings for PDM_PCM

MP_NOINLINE static void machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mplogger_print("machine_pdm_pcm_init_helper \r\n");
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sample_rate,     MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16000} },
        { MP_QSTR_decimation_rate, MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 96} },
        { MP_QSTR_bits,            MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16} },
        { MP_QSTR_format,          MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = MONO_LEFT} },
        { MP_QSTR_left_gain,       MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_LEFT_GAIN} },
        { MP_QSTR_right_gain,      MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_RIGHT_GAIN} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    mp_machine_pdm_pcm_init_helper(self, args);
}

// PDM_PCM(...) Constructor
static mp_obj_t machine_pdm_pcm_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    mplogger_print("machine_pdm_pcm_make_new \r\n");
    mp_arg_check_num(n_pos_args, n_kw_args, 1, MP_OBJ_FUN_ARGS_MAX, true);
    mp_int_t pdm_pcm_id = mp_obj_get_int(args[0]);

    machine_pdm_pcm_obj_t *self = mp_machine_pdm_pcm_make_new_instance(pdm_pcm_id);

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw_args, args + n_pos_args);
    machine_pdm_pcm_init_helper(self, n_pos_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

// constructor()
static machine_pdm_pcm_obj_t *mp_machine_pdm_pcm_make_new_instance(mp_int_t pdm_pcm_id) {
    mplogger_print("mp_machine_pdm_pcm_make_new_instance \r\n");
    (void)pdm_pcm_id;
    machine_pdm_pcm_obj_t *self = NULL;
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PDM_PCM; i++) {
        if (MP_STATE_PORT(machine_pdm_pcm_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
            MP_STATE_PORT(machine_pdm_pcm_obj[i]) = self;
            self->pdm_pcm_id = i;
            break;
        }
    }
    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available pdm pcm instances are allocated"));
    }
    return self;
}

// init.helper()
static void mp_machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, mp_arg_val_t *args) {
    mplogger_print("mp_machine_pdm_pcm_init_helper \r\n");

    // Assign configurable parameters
    // PDM_PCM Mode
    format_t pdm_pcm_format = args[ARG_format].u_int;
    if ((pdm_pcm_format != MONO_LEFT) &&
        (pdm_pcm_format != MONO_RIGHT) &&
        (pdm_pcm_format != STEREO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid format"));
    }
    self->format = pdm_pcm_format;

    // Check word length
    uint8_t pdm_pcm_word_length = args[ARG_bits].u_int;
    if (pdm_pcm_word_length < BITS_16 || pdm_pcm_word_length > BITS_24) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid word length"));
    }
    self->bits = args[ARG_bits].u_int;

    // Set gains
    self->left_gain = args[ARG_left_gain].u_int;
    self->right_gain = args[ARG_right_gain].u_int;

