micropython/micropython/ports/psoc-edge/machine_pdm_pcm.c
    // Set sampling and decimation rates (as given by user)
    self->sample_rate = args[ARG_sample_rate].u_int;

    if (self->sample_rate == 8000 ||
        self->sample_rate == 16000 ||
        self->sample_rate == 48000) {
        if (PLL0_freq != AUDIO_SYS_CLOCK_73_728_000_HZ) {
            mp_raise_ValueError(MP_ERROR_TEXT("Invalid clock frequency set for the sample rate/ PDM_PCM Clock not set . Set the right clock before initialising PDM_PCM"));
        }
    } else if (self->sample_rate == 22050 ||
               self->sample_rate == 44100) {
        if (PLL0_freq != AUDIO_SYS_CLOCK_169_344_000_HZ) {
            mp_raise_ValueError(MP_ERROR_TEXT("Invalid clock frequency set for the sample rate/ PDM_PCM Clock not set. Set the right clock before initialising PDM_PCM"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("rate not supported"));
    }

    self->decimation_rate = args[ARG_decimation_rate].u_int;
    if (self->decimation_rate < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid decimation rate"));
    }

    int32_t ring_buffer_len = 20000;
    if (ring_buffer_len < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid ibuf"));
    }
    self->ibuf = ring_buffer_len;
    self->callback_for_non_blocking = MP_OBJ_NULL;
    self->io_mode = BLOCKING;

    // Initialize buffer pointers
    self->active_rx_buffer = NULL;
    self->full_rx_buffer = NULL;
    self->have_data = false;
    self->pdm_pcm_initialized = false;
    self->init_discard_counter = 0;

    mplogger_print("PDM_PCM configured: sample_rate=%ld, decimation_rate=%d, bits=%u, format=%u, left_gain=%d, right_gain=%d\r\n",
        args[ARG_sample_rate].u_int,
        args[ARG_decimation_rate].u_int,
        args[ARG_bits].u_int,
        args[ARG_format].u_int,
        args[ARG_left_gain].u_int,
        args[ARG_right_gain].u_int);

    ringbuf_alloc(&self->ring_buffer, ring_buffer_len);
    pdm_pcm_init(self);
    /* This function is not yet declared. */
    // pdm_pcm_irq_configure(self);
}

// init()
static void mp_machine_pdm_pcm_init(machine_pdm_pcm_obj_t *self) {
    mplogger_print("mp_machine_pdm_pcm_init \r\n");
    pdm_pcm_rx_init(self);
}

// deinit()
static void mp_machine_pdm_pcm_deinit(machine_pdm_pcm_obj_t *self) {
    mplogger_print("mp_machine_pdm_pcm_deinit \r\n");

    if ((self->format == MONO_LEFT) || (self->format == STEREO)) {
        Cy_PDM_PCM_DeActivate_Channel(PDM0, LEFT_CH_INDEX);
    }
    if ((self->format == MONO_RIGHT) || (self->format == STEREO)) {
        Cy_PDM_PCM_DeActivate_Channel(PDM0, RIGHT_CH_INDEX);
    }
    MP_STATE_PORT(machine_pdm_pcm_obj[self->pdm_pcm_id]) = NULL;
}

// set_gain()
static void mp_machine_pdm_pcm_set_gain(machine_pdm_pcm_obj_t *self, int16_t left_gain, int16_t right_gain) {
    mplogger_print("mp_machine_pdm_pcm_set_gain \r\n");
    Cy_PDM_PCM_SetGain(PDM0, LEFT_CH_INDEX, left_gain);
    Cy_PDM_PCM_SetGain(PDM0, RIGHT_CH_INDEX, right_gain);
}

// irq update
static void mp_machine_pdm_pcm_irq_update(machine_pdm_pcm_obj_t *self) __attribute__((unused));
static void mp_machine_pdm_pcm_irq_update(machine_pdm_pcm_obj_t *self) {
    (void)self;
}

// =======================================================================================
// Implementation for stream protocol
static mp_uint_t machine_pdm_pcm_stream_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    return 0;
}

static const mp_stream_p_t pdm_pcm_stream_p = {
    .read = machine_pdm_pcm_stream_read,
    .is_text = false,
};

static const mp_rom_map_elem_t machine_pdm_pcm_locals_dict_table[] = {
    // Methods
    { MP_ROM_QSTR(MP_QSTR_init),            MP_ROM_PTR(&machine_pdm_pcm_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit),          MP_ROM_PTR(&machine_pdm_pcm_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto),        MP_ROM_PTR(&mp_stream_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_gain),        MP_ROM_PTR(&machine_pdm_pcm_set_gain_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq),             MP_ROM_PTR(&machine_pdm_pcm_irq_obj) },

    #if MICROPY_PY_MACHINE_PDM_PCM_FINALISER
    { MP_ROM_QSTR(MP_QSTR___del__),         MP_ROM_PTR(&machine_pdm_pcm_deinit_obj) },
    #endif

    // Constants
    // Word lengths
    { MP_ROM_QSTR(MP_QSTR_BITS_16),          MP_ROM_INT(BITS_16) },

    // Modes
    { MP_ROM_QSTR(MP_QSTR_STEREO),          MP_ROM_INT(STEREO) },
    { MP_ROM_QSTR(MP_QSTR_MONO_LEFT),       MP_ROM_INT(MONO_LEFT) },
    { MP_ROM_QSTR(MP_QSTR_MONO_RIGHT),      MP_ROM_INT(MONO_RIGHT) },
};
MP_DEFINE_CONST_DICT(machine_pdm_pcm_locals_dict, machine_pdm_pcm_locals_dict_table);

MP_REGISTER_ROOT_POINTER(struct _machine_pdm_pcm_obj_t *machine_pdm_pcm_obj[MICROPY_HW_MAX_PDM_PCM]);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_pdm_pcm_type,
    MP_QSTR_PDM_PCM,
    MP_TYPE_FLAG_ITER_IS_STREAM,
    make_new, machine_pdm_pcm_make_new,
    print, machine_pdm_pcm_print,
    protocol, &pdm_pcm_stream_p,
    locals_dict, &machine_pdm_pcm_locals_dict
    );

#endif // MICROPY_PY_MACHINE_PDM_PCM
